results_chameleon/baremetal/results/disk/disk_baremetal_4threads_20250911_232137.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: directio
128 files, 960MiB each
120GiB total file size
Block size 4KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      29377.53
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  114.76
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0001s
    total number of events:              293876

Latency (ms):
         min:                                    0.09
         avg:                                    0.14
         max:                                    1.72
         95th percentile:                        0.20
         sum:                                39928.17

Threads fairness:
    events (avg/stddev):           73469.0000/51.44
    execution time (avg/stddev):   9.9820/0.00