results_chameleon/baremetal/results/disk/disk_baremetal_64threads_20250911_232137.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Extra file open flags: directio
128 files, 960MiB each
120GiB total file size
Block size 4KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      79893.20
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  312.08
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0008s
    total number of events:              799144

Latency (ms):
         min:                                    0.14
         avg:                                    0.80
         max:                                    5.86
         95th percentile:                        1.30
         sum:                               639670.26

Threads fairness:
    events (avg/stddev):           12486.6250/40.54
    execution time (avg/stddev):   9.9948/0.00