results_chameleon/baremetal/results/disk/disk_baremetal_8threads_20250911_232137.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: directio
128 files, 960MiB each
120GiB total file size
Block size 4KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      47718.30
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  186.40
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0002s
    total number of events:              477279

Latency (ms):
         min:                                    0.09
         avg:                                    0.17
         max:                                    2.80
         95th percentile:                        0.26
         sum:                                79849.01

Threads fairness:
    events (avg/stddev):           59659.8750/194.41
    execution time (avg/stddev):   9.9811/0.00